socialNetwork/results/scaling-on-bench1.5-may21/benchmark1.5-05-21-26_020438/istio/300.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 2361.291ms, rate sampling interval: 8388ms
  Thread calibration: mean lat.: 1609.199ms, rate sampling interval: 6303ms
  Thread calibration: mean lat.: 2076.417ms, rate sampling interval: 7405ms
  Thread calibration: mean lat.: 2050.228ms, rate sampling interval: 7716ms
  Thread calibration: mean lat.: 2039.184ms, rate sampling interval: 7323ms
  Thread calibration: mean lat.: 2166.654ms, rate sampling interval: 7471ms
  Thread calibration: mean lat.: 2127.245ms, rate sampling interval: 7274ms
  Thread calibration: mean lat.: 2131.917ms, rate sampling interval: 7221ms
  Thread calibration: mean lat.: 1673.387ms, rate sampling interval: 5844ms
  Thread calibration: mean lat.: 1870.471ms, rate sampling interval: 5804ms
  Thread calibration: mean lat.: 2528.703ms, rate sampling interval: 8609ms
  Thread calibration: mean lat.: 2284.833ms, rate sampling interval: 7802ms
  Thread calibration: mean lat.: 1622.630ms, rate sampling interval: 5988ms
  Thread calibration: mean lat.: 2150.126ms, rate sampling interval: 7458ms
  Thread calibration: mean lat.: 2302.891ms, rate sampling interval: 8351ms
  Thread calibration: mean lat.: 1377.798ms, rate sampling interval: 5361ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.18s     2.34s    9.61s    84.79%
    Req/Sec    17.92      3.63    33.00     90.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.01ms
 75.000%  863.23ms
 90.000%    4.91s 
 99.000%    9.61s 
 99.900%   13.17s 
 99.990%   15.90s 
 99.999%   15.97s 
100.000%   15.97s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.407     0.000000            1         1.00
      18.863     0.100000         3248         1.11
      20.991     0.200000         6476         1.25
      22.767     0.300000         9715         1.43
      24.335     0.400000        12961         1.67
      26.015     0.500000        16194         2.00
      27.199     0.550000        17812         2.22
      29.071     0.600000        19421         2.50
      32.895     0.650000        21039         2.86
      55.007     0.700000        22656         3.33
     863.231     0.750000        24274         4.00
    1569.791     0.775000        25083         4.44
    2291.711     0.800000        25893         5.00
    2908.159     0.825000        26702         5.71
    3586.047     0.850000        27512         6.67
    4243.455     0.875000        28323         8.00
    4579.327     0.887500        28735         8.89
    4907.007     0.900000        29134        10.00
    5287.935     0.912500        29536        11.43
    5644.287     0.925000        29940        13.33
    6078.463     0.937500        30345        16.00
    6336.511     0.943750        30547        17.78
    6619.135     0.950000        30750        20.00
    6959.103     0.956250        30952        22.86
    7249.919     0.962500        31152        26.67
    7614.463     0.968750        31355        32.00
    7806.975     0.971875        31461        35.56
    8007.679     0.975000        31557        40.00
    8269.823     0.978125        31658        45.71
    8568.831     0.981250        31760        53.33
    8880.127     0.984375        31860        64.00
    9035.775     0.985938        31910        71.11
    9215.999     0.987500        31962        80.00
    9469.951     0.989062        32014        91.43
    9781.247     0.990625        32062       106.67
   10149.887     0.992188        32113       128.00
   10321.919     0.992969        32139       142.22
   10510.335     0.993750        32163       160.00
   10715.135     0.994531        32189       182.86
   10928.127     0.995313        32214       213.33
   11214.847     0.996094        32239       256.00
   11370.495     0.996484        32252       284.44
   11640.831     0.996875        32264       320.00
   11763.711     0.997266        32277       365.71
   11976.703     0.997656        32290       426.67
   12197.887     0.998047        32302       512.00
   12345.343     0.998242        32309       568.89
   12607.487     0.998437        32316       640.00
   12754.943     0.998633        32321       731.43
   12918.783     0.998828        32328       853.33
   13221.887     0.999023        32334      1024.00
   13344.767     0.999121        32337      1137.78
   14000.127     0.999219        32340      1280.00
   14663.679     0.999316        32343      1462.86
   15245.311     0.999414        32347      1706.67
   15466.495     0.999512        32350      2048.00
   15474.687     0.999561        32351      2275.56
   15622.143     0.999609        32353      2560.00
   15654.911     0.999658        32354      2925.71
   15728.639     0.999707        32356      3413.33
   15745.023     0.999756        32358      4096.00
   15745.023     0.999780        32358      4551.11
   15810.559     0.999805        32359      5120.00
   15876.095     0.999829        32360      5851.43
   15892.479     0.999854        32361      6826.67
   15900.671     0.999878        32363      8192.00
   15900.671     0.999890        32363      9102.22
   15900.671     0.999902        32363     10240.00
   15900.671     0.999915        32363     11702.86
   15900.671     0.999927        32363     13653.33
   15925.247     0.999939        32364     16384.00
   15925.247     0.999945        32364     18204.44
   15925.247     0.999951        32364     20480.00
   15925.247     0.999957        32364     23405.71
   15925.247     0.999963        32364     27306.67
   15974.399     0.999969        32365     32768.00
   15974.399     1.000000        32365          inf
#[Mean    =     1180.616, StdDeviation   =     2340.916]
#[Max     =    15966.208, Total count    =        32365]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  34425 requests in 2.00m, 444.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 80
Requests/sec:    286.84  
Transfer/sec:      3.71MB